/*На валізі стоїть тризначний код. Він складається з цифр, які не повторюються. 
Напишіть програму, яка виведе всі можливі такі комбінації цифр. 
А також визначте, скільки часу знадобиться для відкриття валізи в гіршому випадку, 
якщо на один такий набір витрачається 3 секунди.*/

#include<iostream>
using namespace std;
int main() {
	int A = 0, B = 0, C = 0, a = 0, b = 0, c = 0, N = 0;
	
	for (int i = 100; i < 1000; i++) {
		A = i / 100;
		B = (i / 10) - (A * 10);
		C = i - ((A * 100) + (B * 10));

		if (A != B && A != C && B != C) {
			cout << i << ' ';
			N += 3;
		}
	}
	cout << "\n\nV naygirshomy vupadky znadobutsa chasy: " << N << "sek.\nAbo " << double(N) / 60 << " hvulun\n";
}